//let x = prompt("Сколько вам лет?")
//if (x < 10){
//    alert("Вы ребенок")
//}
//else if (x < 18){
//    alert("Вы подросток")
//}
//else if (x < 30){
//    alert("Вы сформированная личность")
//}
//else if (x < 50){
 //   alert("Вы взрослый человек")
//}
//else if(x < 65){
 //   alert("Вы опытный человек")
//}
//else if (x < 100){
//    alert("Вы пенсионер")
//}
//else{
 //   alert("Поздравляю с рекордом!")
//}

//let a = prompt("Введите a число")
  //  b = prompt("Введите b число")
   // c = prompt("Введите c число")
    //d = prompt("Введите d число")
//if (a < b){
 //   alert("Ваше b число больше a числа")
//}
//else if (a == b){
 ///   alert("Ваши числа равняются друг другу")
//}
//else{
 //   alert("Ваше a число больше b числа")
//}
//
//if (c < d){
 //   alert("Ваше d число больше c числа")
///}
//else if (c == d){
 //   alert("Ваши числа равняются друг другу")
//}
//else{
 //   alert("Ваше c число больше d числа")
//}

//if (a < d){
 //   alert("Ваше d число больше a числа")
//}
//else if (a == d){
 //   alert("Ваши числа равняются друг другу")
//}
//else{
 //   alert("Ваше a число больше d числа")
//}
//
//if (b < d){
 //   alert("Ваше d число больше b числа")
//}
//else if (b == d){
 //   alert("Ваши числа равняются друг другу")
//}
//else{
 //   alert("Ваше b число больше d числа")
//}

//if (c < a){
 //   alert("Ваше a число больше c числа")
//}
//else if (c == a){
 //   alert("Ваши числа равняются друг другу")
//}
//else{
 //   alert("Ваше c число больше a числа")
//}

//if (c < b){
 //   alert("Ваше b число больше c числа")
//}
//else if (c == b){
 //   alert("Ваши числа равняются друг другу")
//}
//else{
 //   alert("Ваше c число больше b числа")
///}

//let a = prompt("Триугольник равнобедренный")
//if (a == "да"){
 //   alert("2 сороны равны")
//}
//else{
 //   alert("Разносторонний")
//}

let a = prompt("Если мы решим задачу")
if (a == "да"){
    alert("Едем домой")
}
else if (a == "нет"){
    w = prompt("До скольки ?")
    alert("Остаемся до " + w + " утра")
}
else if (a == "за 7 минут"){
    alert("Денис покупает шоколад")
}